In [1]:
%reload_ext sql

#Connect the notebook with the database
%sql postgresql://user:password@localhost:5432/postgres

In [2]:
%%sql 
DROP TABLE IF EXISTS students;

 * postgresql://user:***@localhost:5432/postgres
Done.

[]

### 1. Create a table called students with the following columns:

student_id | name    | age | major

In [3]:
%%sql

CREATE TABLE students(
    student_id INT PRIMARY KEY,
    name VARCHAR(10) NOT NULL,
    age INT,
    major VARCHAR(30)
);

 * postgresql://user:***@localhost:5432/postgres
Done.

[]

### Fill the table with:

1          | Alice   | 20  | Computer Science

2          | Bob     | 22  | Economics

3          | Charlie | 19  | Chemistry

4          | Diana   | 22  | Computer Science

5          | Eve     | 18  | NULL

6          | Mark     | 25  | History

In [4]:
%%sql 
INSERT INTO students(student_id, name, age, major)
VALUES(1, 'Alice', 20, 'Computer Science'),
(2, 'Bob', 22, 'Economics'),
(3, 'Charlie', 19, 'Chemistry'),
(4, 'Diana', 21, 'Computer Science'),
(5, 'Eve', 18, NULL),
(6, 'Mark', 25, 'History');

 * postgresql://user:***@localhost:5432/postgres
6 rows affected.

[]

In [5]:
%%sql 
SELECT * FROM students;

 * postgresql://user:***@localhost:5432/postgres
6 rows affected.

[(1, 'Alice', 20, 'Computer Science'),
 (2, 'Bob', 22, 'Economics'),
 (3, 'Charlie', 19, 'Chemistry'),
 (4, 'Diana', 21, 'Computer Science'),
 (5, 'Eve', 18, None),
 (6, 'Mark', 25, 'History')]

### 2. Select all student names and ages.

In [6]:
%%sql
SELECT name, age FROM students;

 * postgresql://user:***@localhost:5432/postgres
6 rows affected.

[('Alice', 20),
 ('Bob', 22),
 ('Charlie', 19),
 ('Diana', 21),
 ('Eve', 18),
 ('Mark', 25)]

### 3. Select the students name and age whose age is greater than 20.

In [18]:
%%sql
SELECT name, age FROM students
WHERE age > 20;

 * postgresql://user:***@localhost:5432/postgres
3 rows affected.

[('Bob', 22), ('Diana', 22), ('Mark', 25)]

### 4. Select the name and age of each student, but rename the age column as years_old.

In [8]:
%%sql 
SELECT name, age as years_old FROM students;

 * postgresql://user:***@localhost:5432/postgres
6 rows affected.

[('Alice', 20),
 ('Bob', 22),
 ('Charlie', 19),
 ('Diana', 21),
 ('Eve', 18),
 ('Mark', 25)]

### Now rename the column permanently

In [ ]:
%%sql
ALTER TABLE students
RENAME COLUMN age TO years_old;

 * postgresql://user:***@localhost:5432/postgres
Done.

[]

In [10]:
%%sql 
SELECT name, years_old FROM students;

 * postgresql://user:***@localhost:5432/postgres
6 rows affected.

[('Alice', 20),
 ('Bob', 22),
 ('Charlie', 19),
 ('Diana', 21),
 ('Eve', 18),
 ('Mark', 25)]

### 5. Get the list of unique majors (no duplicates).

In [19]:
%%sql 
SELECT DISTINCT major FROM students;

 * postgresql://user:***@localhost:5432/postgres
5 rows affected.

[(None,), ('Computer Science',), ('Chemistry',), ('History',), ('Economics',)]

### 6. Count how many students are in each major.

In [ ]:
%%sql 
SELECT major, COUNT(*) AS student_count 
FROM students
GROUP BY major;

 * postgresql://user:***@localhost:5432/postgres
5 rows affected.

[(None, 1),
 ('Computer Science', 2),
 ('Chemistry', 1),
 ('History', 1),
 ('Economics', 1)]

### 7. Display the table ordered by age ascending.

In [13]:
%%sql
SELECT * FROM students
ORDER BY years_old ASC;

 * postgresql://user:***@localhost:5432/postgres
6 rows affected.

[(5, 'Eve', 18, None),
 (3, 'Charlie', 19, 'Chemistry'),
 (1, 'Alice', 20, 'Computer Science'),
 (4, 'Diana', 21, 'Computer Science'),
 (2, 'Bob', 22, 'Economics'),
 (6, 'Mark', 25, 'History')]

### 8. Display the students ordered by age descending, showing only name and age.

In [14]:
%%sql
SELECT name, years_old FROM students
ORDER BY years_old DESC;

 * postgresql://user:***@localhost:5432/postgres
6 rows affected.

[('Mark', 25),
 ('Bob', 22),
 ('Diana', 21),
 ('Alice', 20),
 ('Charlie', 19),
 ('Eve', 18)]

### 9. Get the average age of students grouped by major.

In [15]:
%%sql
SELECT major, ROUND(AVG(years_old),2) as average
FROM students
GROUP BY major;

 * postgresql://user:***@localhost:5432/postgres
5 rows affected.

[(None, Decimal('18.00')),
 ('Computer Science', Decimal('20.50')),
 ('Chemistry', Decimal('19.00')),
 ('History', Decimal('25.00')),
 ('Economics', Decimal('22.00'))]

### 10. Show only the majors that have more than 1 student.

In [16]:
%%sql
SELECT major, COUNT(*) AS student_count FROM students
GROUP BY major
HAVING COUNT(*) > 1;

 * postgresql://user:***@localhost:5432/postgres
1 rows affected.

[('Computer Science', 2)]

### 11. Display all students ordered first by major (alphabetically) and then by age (descending).

In [17]:
%%sql 
SELECT * FROM students
ORDER BY major ASC, years_old DESC;

 * postgresql://user:***@localhost:5432/postgres
6 rows affected.

[(3, 'Charlie', 19, 'Chemistry'),
 (4, 'Diana', 21, 'Computer Science'),
 (1, 'Alice', 20, 'Computer Science'),
 (2, 'Bob', 22, 'Economics'),
 (6, 'Mark', 25, 'History'),
 (5, 'Eve', 18, None)]